TEXTS = {
    "ru": {
        "welcome": "Добро пожаловать в сервис LPG 🚗",
        "choose_role": "Выберите вашу роль:",
        "driver": "🚗 Я водитель",
        "owner": "⛽ Я владелец АГЗС (LPG)",

        "send_location": "📍 Отправьте вашу геолокацию",
        "gas_available": "🟢 Газ в наличии",
        "gas_low": "🟡 Мало газа",
        "gas_none": "🔴 Нет газа",
        "gas_unknown": "⚪ Статус неизвестен"
    },

    "kz": {
        "welcome": "LPG сервисіне қош келдіңіз 🚗",
        "choose_role": "Өзіңіздің рөліңізді таңдаңыз:",
        "driver": "🚗 Мен жүргізушімін",
        "owner": "⛽ Мен АГҚС (LPG) иесімін",

        "send_location": "📍 Орналасқан жеріңізді жіберіңіз",
        "gas_available": "🟢 Газ бар",
        "gas_low": "🟡 Газ аз",
        "gas_none": "🔴 Газ жоқ",
        "gas_unknown": "⚪ Статус белгісіз"
    }
}